mobiaqua/ti-sysbios-c64t/packages/ti/sysbios/family/arm/cc26xx/Power.c
/*
 * Copyright (c) 2014-2015, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQueueNTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*
 *  ======== Power.c ========
 */

#include <xdc/std.h>
#include <xdc/runtime/Startup.h>
#include <xdc/runtime/Memory.h>
#include <xdc/runtime/Types.h>
#include <xdc/runtime/Error.h>
#include <xdc/runtime/Assert.h>

#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/hal/Hwi.h>
#include <ti/sysbios/knl/Clock.h>
#include <ti/sysbios/knl/Task.h>
#include <ti/sysbios/knl/Swi.h>
#include <ti/sysbios/knl/Queue.h>
#include <ti/sysbios/knl/Intrinsics.h>

#include "PowerCC2650.h"

/* driverlib header files */
#include <inc/hw_types.h>
#include <inc/hw_prcm.h>
#include <inc/hw_nvic.h>
#include <inc/hw_aon_wuc.h>
#include <inc/hw_aon_rtc.h>
#include <inc/hw_memmap.h>
#include <inc/hw_ccfg.h>
#include <inc/hw_rfc_pwr.h>
#include <driverlib/sys_ctrl.h>
#include <driverlib/pwr_ctrl.h>
#include <driverlib/prcm.h>
#include <driverlib/aon_wuc.h>
#include <driverlib/aon_ioc.h>
#include <driverlib/aon_rtc.h>
#include <driverlib/aon_event.h>
#include <driverlib/aux_wuc.h>
#include <driverlib/osc.h>
#include <driverlib/cpu.h>
#include <driverlib/vims.h>
#include <driverlib/rfc.h>
#include <driverlib/sys_ctrl.h>
#include <driverlib/driverlib_release.h>

#include "package/internal/Power.xdc.h"

#define SCLK_LF_OPTION_RCOSC_LF         3  /* defined in cc26_ccfg.xls */

/*
 *  Resource database records.  Each record contains:
 *    { flags, flags2 , driverlibID}
 *
 *  flags  = type : parent1
 *  flags2 = parent2
 */
const ti_sysbios_family_arm_cc26xx_Power_ResourceRecord
    ti_sysbios_family_arm_cc26xx_Power_db[RESOURCE_END] =
{
/*  type       parent1      parent2      driverlibID
    ----      ----------   --------- ------------------- */
 { PERIPH  | DOMAIN_PERIPH, NOPARENT, PRCM_PERIPH_TIMER0 },/* PERIPH_GPT0 */
 { PERIPH  | DOMAIN_PERIPH, NOPARENT, PRCM_PERIPH_TIMER1 },/* PERIPH_GPT1 */
 { PERIPH  | DOMAIN_PERIPH, NOPARENT, PRCM_PERIPH_TIMER2 },/* PERIPH_GPT2 */
 { PERIPH  | DOMAIN_PERIPH, NOPARENT, PRCM_PERIPH_TIMER3 },/* PERIPH_GPT3 */
 { PERIPH  | DOMAIN_SERIAL, NOPARENT, PRCM_PERIPH_SSI0 },  /* PERIPH_SSI0 */
 { PERIPH  | DOMAIN_PERIPH, NOPARENT, PRCM_PERIPH_SSI1 },  /* PERIPH_SSI1 */
 { PERIPH  | DOMAIN_SERIAL, NOPARENT, PRCM_PERIPH_UART0 }, /* PERIPH_UART0 */
 { PERIPH  | DOMAIN_SERIAL, NOPARENT, PRCM_PERIPH_I2C0 },  /* PERIPH_I2C0 */
 { PERIPH  | DOMAIN_PERIPH, NOPARENT, PRCM_PERIPH_TRNG },  /* PERIPH_TRNG */
 { PERIPH  | DOMAIN_PERIPH, NOPARENT, PRCM_PERIPH_GPIO },  /* PERIPH_GPIO */
 { PERIPH  | DOMAIN_PERIPH, DOMAIN_SYSBUS, PRCM_PERIPH_UDMA }, /* PERIPH_UDMA */
 { PERIPH  | DOMAIN_PERIPH, NOPARENT, PRCM_PERIPH_CRYPTO },/* PERIPH_CRYPTO */
 { PERIPH  | DOMAIN_PERIPH, NOPARENT, PRCM_PERIPH_I2S },   /* PERIPH_I2S */
 { SPECIAL | DOMAIN_RFCORE, NOPARENT, 0 },                 /* PERIPH_RFCORE */
 { SPECIAL | NOPARENT,      NOPARENT, 1 },                 /* XOSC_HF */
 { DOMAIN  | NOPARENT,      NOPARENT, PRCM_DOMAIN_PERIPH },/* DOMAIN_PERIPH */
 { DOMAIN  | NOPARENT,      NOPARENT, PRCM_DOMAIN_SERIAL },/* DOMAIN_SERIAL */
 { DOMAIN  | NOPARENT,      NOPARENT, PRCM_DOMAIN_RFCORE },/* DOMAIN_RFCORE */
 { SPECIAL | NOPARENT,      NOPARENT, 2 }                  /* DOMAIN_SYSBUS */
};

/* resource reference count array */
volatile UInt8 ti_sysbios_family_arm_cc26xx_Power_refCount[RESOURCE_END] =
    { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

/* constraint counts array */
/* careful: bitmask values index to this array, be sure they are contiguous */
volatile UInt8 ti_sysbios_family_arm_cc26xx_Power_constraintCounts[
    ti_sysbios_family_arm_cc26xx_Power_NUMCONSTRAINTS] =
    { 0, 0, 0, 0, 0 };


/* * * * * * * * * * * * * * * * * APIs * * * * * * * * * * * * * * * * * */

/*
 *  ======== Power_getClockHandle ========
 */
Clock_Handle Power_getClockHandle()
{
    return (Power_Module_State_clockObj());
}

/*
 *  ======== Power_getConstraintInfo ========
 *  Get a bitmask indicating the constraints that have been registered with
 *  Power.
 */
UInt32 Power_getConstraintInfo(Void)
{
    return (Power_module->constraintsMask);
}

/*
 *  ======== Power_getDependencyCount ========
 *  Get the count of dependencies that are currently declared upon a resource.
 */
UInt32 Power_getDependencyCount(Power_Resource resourceID)
{
    return (Power_module->resourceCounts[resourceID]);
}

/*
 *  ======== Power_getTicksUntilWakeup ========
 *  Get the number of system ticks until the next scheduled wakeup event
 */
UInt32 Power_getTicksUntilWakeup(Void)
{
    return (Clock_getTicksUntilInterrupt());
}

