mobiaqua/ti-sysbios-c64t/packages/ti/sysbios/family/arm/cc26xx/Power.c
/*
 *  ======== Power_getTransitionLatency ========
 *  Get the transition latency for a sleep state.  The latency is reported
 *  in units of Clock ticks.
 */
UInt32 Power_getTransitionLatency(Power_SleepState sleepState,
    Power_LatencyType type)
{
    UInt32 latency = 0;

    if (type == Power_RESUME) {
        if (sleepState == Power_STANDBY) {
            latency = Power_resumeTicksSTANDBY;
        }
    }
    else {
        if (sleepState == Power_STANDBY) {
            latency = Power_totalTicksSTANDBY;
        }
    }

    return (latency);
}

/*
 *  ======== Power_getTransitionState ========
 *  Get the current sleep transition state.
 */
Power_TransitionState Power_getTransitionState(Void)
{
    return (Power_module->state);
}

/*
 *  ======== Power_getXoscStartupTime ========
 *  Get the estimated crystal oscillator startup time
 */
UInt32 Power_getXoscStartupTime(UInt32 timeUntilWakeupInMs)
{
    return (OSCHF_GetStartupTime(timeUntilWakeupInMs));
}

/*
 *  ======== Power_injectCalibration ========
 *  Explicitly trigger RCOSC calibration
 */
Void Power_injectCalibration(Void)
{
    if (Power_calibrateRCOSC) {
        if (Power_initiateCalibration()) {
            /* here if AUX SMPH was available, start calibration now ... */
            Power_doCalibrate();
         }
     }
}

/*
 *  ======== Power_isStableXOSC_HF ========
 *  Check if XOSC_HF has stabilized.
 */
Bool Power_isStableXOSC_HF(Void)
{
    Bool ready = TRUE;
    UInt key;

    key = Hwi_disable();

    /* only query if HF source is ready if there is a pending change */
    if (Power_module->xoscPending) {
        ready = OSCHfSourceReady();
    }

    Hwi_restore(key);

    return (ready);
}

/*
 *  ======== Power_releaseConstraint ========
 *  Release a previously declared constraint.
 */
Void Power_releaseConstraint(Power_Constraint constraint)
{
    UInt key;
    UInt8 count;

    key = Hwi_disable();

    count = Power_module->constraintCounts[Intrinsics_maxbit(constraint)];

    Assert_isTrue(count != 0, Power_A_tooManyCallsReleaseConstraint);

    count = count - 1;

    Power_module->constraintCounts[Intrinsics_maxbit(constraint)] = count;

    if (count == 0) {
        Power_module->constraintsMask &= ~constraint;
    }

    Hwi_restore(key);
}

/*
 *  ======== Power_releaseDependency ========
 *  Release a previously declared dependency.
 */
Void Power_releaseDependency(Power_Resource resourceID)
{
    UInt8 parent;
    UInt8 count;
    UInt32 id;
    UInt key;

    /* disable interrupts */
    key = Hwi_disable();

    /* read and decrement the reference count */
    count = Power_module->resourceCounts[resourceID];

    Assert_isTrue(count != 0, Power_A_tooManyCallsReleaseDependency);

    count = count - 1;

    Power_module->resourceCounts[resourceID] = count;

    /* if this was the last dependency being released.., */
    if (count == 0) {

        /* deactivate this resource ... */
        id = Power_module->resourceDB[resourceID].driverlibID;

        /* is resource a peripheral?... */
        if (Power_module->resourceDB[resourceID].flags
            & PERIPH) {
            PRCMPeripheralRunDisable(id);
            PRCMPeripheralSleepDisable(id);
            PRCMPeripheralDeepSleepDisable(id);
            PRCMLoadSet();
            while(!PRCMLoadGet())
                {};
        }

        /* else, does resource require a special handler?... */
        else if (Power_module->resourceDB[resourceID].flags
            & SPECIAL) {

            /* call the special handler */
            Power_module->resourceHandlers[id](DISABLE);
        }

        /* else resource is a power domain */
        else {
            PRCMPowerDomainOff(id);
            while (PRCMPowerDomainStatus(id) != PRCM_DOMAIN_POWER_OFF) {};
        }

        /* propagate release up the dependency tree ... */

        /* check for a first parent */
        parent = Power_module->resourceDB[resourceID].flags
          & PARENTMASK;

        /* if 1st parent, make recursive call to release that dependency */
        if (parent != NOPARENT) {
            Power_releaseDependency(parent);
        }

        /* check for a second parent */
        parent = Power_module->resourceDB[resourceID].flags2
          & PARENTMASK;

        /* if 2nd parent, make recursive call to release that dependency */
        if (parent != NOPARENT) {
            Power_releaseDependency(parent);
        }
    }

    /* re-enable interrupts */
    Hwi_restore(key);
}

/*
 *  ======== Power_registerNotify ========
 *  Register a function to be called on a specific power event.
 *
 */
Power_Status Power_registerNotify(Power_NotifyObj * pNotifyObj,
    UInt32 eventTypes, Fxn notifyFxn, UArg clientArg, UArg arg)
{
    /* check for NULL pointers  */
    if ((pNotifyObj == NULL) || (notifyFxn == NULL)) {
        return (Power_EINVALIDPOINTER);
    }

    /* fill in notify object elements */
    pNotifyObj->eventTypes = eventTypes;
    pNotifyObj->notifyFxn = notifyFxn;
    pNotifyObj->clientArg = clientArg;

    /* place notify object on event notification queue */
    Queue_put(Power_Module_State_notifyQ(), (Queue_Elem*) pNotifyObj);

    return (Power_SOK);
}

/*
 *  ======== Power_setDependency ========
 *  Declare a dependency upon a resource.
 */
Bool Power_setDependency(Power_Resource resourceID)
{
    UInt8 parent;
    UInt8 count;
    UInt32 id;
    UInt key;

    /* disable interrupts */
    key = Hwi_disable();

    /* read and increment reference count */
    count = Power_module->resourceCounts[resourceID]++;

    /* if resource was NOT activated previously ... */
    if (count == 0) {

        /* propagate set up the dependency tree ... */

        /* check for a first parent */
        parent = Power_module->resourceDB[resourceID].flags
          & PARENTMASK;

        /* if first parent, make recursive call to set that dependency */
        if (parent != NOPARENT) {
            Power_setDependency(parent);
        }

        /* check for a second parent */
        parent = Power_module->resourceDB[resourceID].flags2
          & PARENTMASK;

        /* if second parent, make recursive call to set that dependency */
        if (parent != NOPARENT) {
            Power_setDependency(parent);
        }

        /* now activate this resource ... */
        id = Power_module->resourceDB[resourceID].driverlibID;

