mobiaqua/ti-sysbios-c64t/packages/ti/sysbios/family/arm/cc26xx/Power.c
        /* is resource a peripheral?... */
        if (Power_module->resourceDB[resourceID].flags & PERIPH) {
            PRCMPeripheralRunEnable(id);
            PRCMPeripheralSleepEnable(id);
            PRCMPeripheralDeepSleepEnable(id);
            PRCMLoadSet();
            while(!PRCMLoadGet()){};
        }

        /* else, does resource require a special handler?... */
        else if (Power_module->resourceDB[resourceID].flags
            & SPECIAL) {

            /* call the special handler */
            Power_module->resourceHandlers[id](ENABLE);
        }

        /* else resource is a power domain */
        else {
            PRCMPowerDomainOn(id);
            while (PRCMPowerDomainStatus(id) != PRCM_DOMAIN_POWER_ON)
                {};
        }
    }

    /* re-enable interrupts */
    Hwi_restore(key);

    /* return the resource's activation status */
    return (Power_isDependencyActive(resourceID));
}

/*
 *  ======== Power_setConstraint ========
 *  Declare an operational constraint.
 */
Void Power_setConstraint(Power_Constraint constraint)
{
    UInt key;

    key = Hwi_disable();
    Power_module->constraintsMask |= constraint;
    Power_module->constraintCounts[Intrinsics_maxbit(constraint)]++;
    Hwi_restore(key);
}

/*
 *  ======== Power_shutdown ========
 */
Power_Status Power_shutdown(UArg arg)
{
    Power_Status status;
    UInt32 constraints;
    UInt hwiKey;

    /* make sure shutdown request doesn't violate a constraint */
    constraints = Power_getConstraintInfo();
    if ((constraints & (Power_SD_DISALLOW)) != 0) {
        return (Power_ECHANGE_NOT_ALLOWED);
    }

    /* next make sure Power is not still busy with a previous transition */
    hwiKey = Hwi_disable();

    if (Power_module->state == Power_ACTIVE) {
        /* set new transition state to entering shutdown */
        Power_module->state = Power_SHUTDOWN;
    }
    else {
        Hwi_restore(hwiKey);
        return (Power_EBUSY);
    }

    /* signal all clients registered for pre-shutdown notification */
    status = Power_notify(Power_ENTERING_SHUTDOWN);

    /* check for any error */
    if (status != Power_SOK) {
        Power_module->state = Power_ACTIVE;
        Hwi_restore(hwiKey);
        return (status);
    }

    /* now proceed with shutdown sequence ... */

    /* 1. Switch HF, MF, and LF clocks to source from RCOSC_HF */
    OSCInterfaceEnable();
    if(OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_RCOSC_HF) {
        OSCClockSourceSet(OSC_SRC_CLK_HF | OSC_SRC_CLK_MF,
            OSC_RCOSC_HF);
        while(!OSCHfSourceReady());
        OSCHfSourceSwitch();
    }
    OSCInterfaceDisable();

    /* 2. Make sure DMA and CRYTO clocks are off in deep-sleep */
    PRCMPeripheralDeepSleepDisable(PRCM_PERIPH_CRYPTO);
    PRCMPeripheralDeepSleepDisable(PRCM_PERIPH_UDMA);
    PRCMLoadSet();
    while(!PRCMLoadGet())
        {};

    /* 3. Power OFF AUX and disconnect from bus */
    AUXWUCPowerCtrl(AUX_WUC_POWER_OFF);

    /* 4. Remove AUX force ON */
    HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL) &=
        ~AON_WUC_AUXCTL_AUX_FORCE_ON;

    /*
     * 5. Reset AON event source IDs to avoid pending events powering
     * on MCU/AUX
     */
    HWREG(AON_EVENT_BASE + AON_EVENT_O_MCUWUSEL) = 0x3F3F3F3F;
    HWREG(AON_EVENT_BASE + AON_EVENT_O_AUXWUSEL) = 0x003F3F3F;

    /* sync AON */
    SysCtrlAonSync();

    /*
     * 6. Enable shutdown - this latches the IOs, so configuration of
     * IOCFGx registers must be done prior to this
     */
    AONWUCShutDownEnable();

    /* 7. Sync AON */
    SysCtrlAonSync();

    /* 8. Wait until AUX powered off */
    while (AONWUCPowerStatusGet() & AONWUC_AUX_POWER_ON);

    /* 9. Request to power off MCU when go to deep sleep */
    PRCMMcuPowerOff();

    /*
     * 10. Turn off power domains inside MCU VD (BUS, FL_BUS, RFC,
     * CPU)
     */
    PRCMPowerDomainOff(PRCM_DOMAIN_RFCORE | PRCM_DOMAIN_SERIAL |
        PRCM_DOMAIN_PERIPH | PRCM_DOMAIN_CPU | PRCM_DOMAIN_VIMS);

    /* 11. Deep sleep to activate shutdown */
    PRCMDeepSleep();

    /* NOTE: if shutdown succeeded, should never get here */

    /* return failure status */
    Power_module->state = Power_ACTIVE;
    Hwi_restore(hwiKey);
    return (Power_EFAIL);
}

/*
 *  ======== Power_sleep ========
 */
Power_Status Power_sleep(Power_SleepState sleepState, UArg arg0, UArg arg1)
{
    Power_Status status = Power_SOK;
    UInt xosc_hf_active = FALSE;
    Power_Event postEventLate;
    UInt32 poweredDomains = 0;
    Power_Event preEvent;
    Power_Event postEvent;
    UInt32 constraints;
    Bool retainCache = FALSE;
    UInt32 modeVIMS;
    UInt taskKey;
    UInt swiKey;

    /* first validate the sleep code */
    if (sleepState != Power_STANDBY) {
        status = Power_EFAIL;
    }

    if (status == Power_SOK) {

        if (Power_module->state == Power_ACTIVE) {

            /* set transition state to entering sleep */
            Power_module->state = Power_ENTERING_SLEEP;
        }
        else {
            status = Power_EBUSY;
        }

        if (status == Power_SOK) {

            /* setup sleep vars */
            preEvent = Power_ENTERING_STANDBY;
            postEvent = Power_AWAKE_STANDBY;
            postEventLate = Power_AWAKE_STANDBY_LATE;

            /* disable Task scheduling; allow Swis and Hwis for notifications */
            taskKey = Task_disable();

            /* signal all clients registered for pre-sleep notification */
            status = Power_notify(preEvent);

            /* check for any error */
            if (status != Power_SOK) {
                Power_module->state = Power_ACTIVE;
                Task_restore(taskKey);          /* re-enable scheduler */
                return (status);
            }

            /* now disable Swi scheduling */
            swiKey = Swi_disable();

            /* 1. Freeze the IOs on the boundary between MCU and AON */
            AONIOCFreezeEnable();

            /* 2. If XOSC_HF is active, force it off */
            if(OSCClockSourceGet(OSC_SRC_CLK_HF) == OSC_XOSC_HF) {
                xosc_hf_active = TRUE;
                Power_XOSC_HF(DISABLE);
            }

