mobiaqua/ti-sysbios-c64t/packages/ti/sysbios/family/arm/cc26xx/Power.c
            /* 3. Allow AUX to power down */
            AONWUCAuxWakeupEvent(AONWUC_AUX_ALLOW_SLEEP);

            /* 4. Make sure writes take effect */
            SysCtrlAonSync();

            /* now proceed to transition to Power_STANDBY ... */

            /* 5. Query and save domain states before powering them off */
            if (Power_getDependencyCount(DOMAIN_RFCORE)) {
                poweredDomains |= PRCM_DOMAIN_RFCORE;
            }
            if (Power_getDependencyCount(DOMAIN_SERIAL)){
                poweredDomains |= PRCM_DOMAIN_SERIAL;
            }
            if (Power_getDependencyCount(DOMAIN_PERIPH)) {
                poweredDomains |= PRCM_DOMAIN_PERIPH;
            }

            /* 6. Gate running deep sleep clocks for Crypto and DMA */
            if (Power_getDependencyCount(PERIPH_CRYPTO)) {
                PRCMPeripheralDeepSleepDisable(
                    Power_module->resourceDB[PERIPH_CRYPTO].driverlibID);
            }
            if (Power_getDependencyCount(PERIPH_UDMA)) {
                PRCMPeripheralDeepSleepDisable(
                    Power_module->resourceDB[PERIPH_UDMA].driverlibID);
            }
            /* 7. Make sure clock settings take effect */
            PRCMLoadSet();

            /* 8. Request power off of domains in the MCU voltage domain */
            PRCMPowerDomainOff(poweredDomains | PRCM_DOMAIN_CPU);

            /* 9. Request uLDO during standby */
            PRCMMcuUldoConfigure(true);

            /* query constraints to determine if cache should be retained */
            constraints = Power_getConstraintInfo();
            if ((constraints & Power_SB_VIMS_CACHE_RETAIN) != 0) {
                retainCache = TRUE;
            }

            /* 10. If don't want retention in standby, disable it now ... */
            if (retainCache == FALSE) {
                /* 10.1 Get current VIMS mode */
                modeVIMS = VIMSModeGet(VIMS_BASE);
                /* 10.2 Wait if invalidate in progress... */
                while (modeVIMS == VIMS_MODE_CHANGING) {
                    modeVIMS = VIMSModeGet(VIMS_BASE);
                }
                /* 10.3 Disable cache RAM retention */
                PRCMCacheRetentionDisable();
                /* 10.4 Turn off the VIMS */
                VIMSModeSet(VIMS_BASE, VIMS_MODE_OFF);
            }

            /* 11. Setup recharge parameters */
            SysCtrlSetRechargeBeforePowerDown(XoscInHighPowerMode);

            /* 12. Make sure all writes have taken effect */
            SysCtrlAonSync();

            /* 13. Invoke deep sleep to go to STANDBY */
            PRCMDeepSleep();

            /* 14. If didn't retain cache in standby, re-enable retention now */
            if (retainCache == FALSE) {
                VIMSModeSet(VIMS_BASE, modeVIMS);
                PRCMCacheRetentionEnable();
            }

            /*
             * 15. Force power on of AUX to keep it on when system is not
             * sleeping; this also counts as a write to the AON interface
             * ensuring that a following sync of the AON interface will
             * force an update of all registers
             */
            AONWUCAuxWakeupEvent(AONWUC_AUX_WAKEUP);
            while(!(AONWUCPowerStatusGet() & AONWUC_AUX_POWER_ON)) {};

            /* 16. If XOSC_HF was forced off above, initiate switch back */
            if (xosc_hf_active == TRUE) {
                Power_XOSC_HF(ENABLE);
            }

            /* 17. Restore power domain states in effect before standby */
            PRCMPowerDomainOn(poweredDomains);
            while (PRCMPowerDomainStatus(poweredDomains) !=
                PRCM_DOMAIN_POWER_ON){};

            /* 18. Restore deep sleep clocks of Crypto and DMA */
            if (Power_getDependencyCount(PERIPH_CRYPTO)) {
                PRCMPeripheralDeepSleepEnable(
                    Power_module->resourceDB[PERIPH_CRYPTO].driverlibID);
            }
            if (Power_getDependencyCount(PERIPH_UDMA)) {
                PRCMPeripheralDeepSleepEnable(
                    Power_module->resourceDB[PERIPH_UDMA].driverlibID);
            }

            /* 19. Make sure clock settings take effect */
            PRCMLoadSet();

            /* 20. Release request for uLDO */
            PRCMMcuUldoConfigure(false);

            /* 21. Set transition state to EXITING_SLEEP */
            Power_module->state = Power_EXITING_SLEEP;

            /*
             * 22. Signal clients registered for early post-sleep notification;
             * this should be used to initialize any timing critical or IO
             * dependent hardware
             */
            status = Power_notify(postEvent);

            /* 23. Disable IO freeze and ensure RTC shadow value is updated */
            AONIOCFreezeDisable();
            SysCtrlAonSync();

            /* 24. Re-enable interrupts */
            CPUcpsie();

            /*
             * 25. Signal all clients registered for late post-sleep
             * notification
             */
            status = Power_notify(postEventLate);

            /*
             * 26. Now clear the transition state before re-enabling
             * scheduler
             */
            Power_module->state = Power_ACTIVE;

            /* 27. Re-enable Swi scheduling */
            Swi_restore(swiKey);

            /* 28. Adjust recharge parameters */
            SysCtrlAdjustRechargeAfterPowerDown();

            /* re-enable Task scheduling */
            Task_restore(taskKey);
        }
    }

    return (status);
}

/*
 *  ======== Power_switchXOSC_HF ========
 *  Switch to enable XOSC_HF.
 */
Void Power_switchXOSC_HF(Void)
{
    UInt key;

    key = Hwi_disable();

    /* only switch source if there is a pending change */
    if (Power_module->xoscPending == TRUE) {
        OSCHF_AttemptToSwitchToXosc();
        Power_module->xoscPending = FALSE;
    }

    Hwi_restore(key);
}

/*
 *  ======== Power_unregisterNotify ========
 *  Unregister for a power notification.
 *
 */
Void Power_unregisterNotify(Power_NotifyObj * pNotifyObj)
{
    UInt key;

    /* remove notify object from its event queue */
    key = Hwi_disable();
    Queue_remove((Queue_Elem *)pNotifyObj);
    Hwi_restore(key);
}


