mobiaqua/ti-sysbios-c64t/packages/ti/sysbios/family/arm/cc26xx/Power.c
/* * * * * * * * * * * internal and support functions * * * * * * * * * * */

/*
 *  ======== Power_Module_startup ========
 */
Int ti_sysbios_family_arm_cc26xx_Power_Module_startup(Int status)
{
    UInt32 ccfgLfClkSrc;

    DRIVERLIB_ASSERT_CURR_RELEASE();

    /* check if should calibrate RCOSC_LF */
    if (Power_calibrateRCOSC_LF) {

        /* read the LF clock source from CCFG */
        ccfgLfClkSrc = (HWREG(CCFG_BASE + CCFG_O_MODE_CONF) &
            CCFG_MODE_CONF_SCLK_LF_OPTION_M) >> CCFG_MODE_CONF_SCLK_LF_OPTION_S;

        /* verify RCOSC_LF is the LF clock source */
        if (ccfgLfClkSrc == SCLK_LF_OPTION_RCOSC_LF) {
            Power_module->calLF = true;
        }
    }

    /* set standby disallow constraint pending LF clock quailifier disabling */
    Power_setConstraint(Power_SB_DISALLOW);

    return (Startup_DONE);
}

/*
 *  ======== Power_defaultClockFunc ========
 *  Clock function used by power policy to schedule early wakeups.
 */
Void Power_defaultClockFunc(UArg arg)
{
}

/*
 *  ======== Power_defaultNotifyTrapFunc ========
 */
Void Power_defaultNotifyTrapFunc()
{
    while (1) {};
}

/*
 *  ======== Power_doWFI ========
 */
Void Power_doWFI()
{
    __asm(" wfi");
}

/*
 *  ======== Power_LF_clockFunc ========
 *  Clock function used for delayed disable of LF clock qualifiers.
 */
Void Power_LF_clockFunc(UArg arg)
{
    UInt32 sourceLF;

     /* query LF clock source */
    sourceLF = OSCClockSourceGet(OSC_SRC_CLK_LF);

    /* is LF source either RCOSC_LF or XOSC_LF yet? */
    if ((sourceLF == OSC_RCOSC_LF) || (sourceLF == OSC_XOSC_LF)) {

        /* yes, disable the LF clock qualifiers */
        DDI16BitfieldWrite(
            AUX_DDI0_OSC_BASE,
            DDI_0_OSC_O_CTL0,
            DDI_0_OSC_CTL0_BYPASS_XOSC_LF_CLK_QUAL_M|
                DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_M,
            DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_S,
            0x3
        );

        /* now finish by releasing the standby disallow constraint */
        Power_releaseConstraint(Power_SB_DISALLOW);
    }

    /* not yet, LF still derived from HF, restart clock to check back later */
    else {
        /* retrigger LF Clock to fire in 100 msec */
        Clock_setTimeout(
            ti_sysbios_family_arm_cc26xx_Power_Module_State_lfClockObj(),
            (100000 / Clock_tickPeriod));
        Clock_start(
            ti_sysbios_family_arm_cc26xx_Power_Module_State_lfClockObj());
    }
}
/*
 *  ======== Power_notify ========
 *  Send notifications to registered clients.
 *  Note: Task scheduling is disabled when this function is called.
 */
Power_Status Power_notify(Power_Event eventType)
{
    Power_Status returnStatus = Power_SOK;
    Power_NotifyResponse notifyStatus;
    Queue_Handle notifyQ;

    notifyQ = Power_Module_State_notifyQ();

    /* if notification queue is not empty, service the queue */
    if (!Queue_empty(notifyQ)) {

       /* service the notification queue... */
       notifyStatus = Power_serviceNotifyQ(eventType);

       /* if notifications did not complete successfully ... */
        if (notifyStatus != Power_NOTIFYDONE) {

            /* call the configured notify trap function */
            (*(Power_FuncPtr)Power_notifyTrapFunc)();

            returnStatus = Power_EFAIL;
        }
    }

    return (returnStatus);
}

/*
 *  ======== Power_serviceNotifyQ ========
 */
Power_NotifyResponse Power_serviceNotifyQ(Power_Event eventType)
{
    Power_NotifyResponse returnStatus = Power_NOTIFYDONE;
    Power_NotifyResponse clientStatus;
    Queue_Handle notifyQ;
    Queue_Elem * elem;
    Fxn notifyFxn;
    UArg clientArg;

    notifyQ = Power_Module_State_notifyQ();

    /* point to first client notify object */
    elem = Queue_head(notifyQ);

    /* walk the queue and notify each registered client of the event */
    do {
        if (((Power_NotifyObj *)elem)->eventTypes & eventType) {

            /* pull params from notify object */
            notifyFxn = ((Power_NotifyObj *)elem)->notifyFxn;
            clientArg = ((Power_NotifyObj *)elem)->clientArg;

            /* call the client's notification function */
            clientStatus = (Power_NotifyResponse) (*(Fxn)notifyFxn)(
                eventType, clientArg);

            /* if client declared error stop all further notifications */
            if (clientStatus == Power_NOTIFYERROR) {
                return (Power_NOTIFYERROR);
            }
        }

        /* get next element in the notification queue */
        elem = Queue_next(elem);

    } while (elem != (Queue_Elem *) notifyQ);

    return (returnStatus);
}

/*
 *  ======== Power_RFCORECLKS ========
 *  Special dependency function for controlling RF core clocks.
 */
UInt Power_RFCORECLKS (UInt action)
{
    if (action == ENABLE) {
        RFCClockEnable();
    }
    else {
        RFCClockDisable();
    }
    return (0);
}

/*
 *  ======== Power_XOSC_HF_clockFunc ========
 *  Clock function used for delayed switching to XOSC_HF.
 */
Void Power_XOSC_HF_clockFunc(UArg arg0)
{
    Bool readyToCal;
    UInt32 timeout;
    UInt key;

    key = ti_sysbios_hal_Hwi_disable();

    /* if pending switch has already been made, just send out notifications */
    if (Power_module->xoscPending == FALSE) {

        /* initiate RCOSC calibration */
        if (Power_calibrateRCOSC) {
            readyToCal = Power_initiateCalibration();
        }

        /* notify clients that were waiting for a switch notification */
        Power_notify(Power_XOSC_HF_SWITCHED);

        /* if ready to start first cal measurment, do it now */
        if (Power_calibrateRCOSC) {
            if (readyToCal == TRUE) {
                Power_doCalibrate();
            }
        }
    }

    /* else, if HF ready to switch, do it now ... */
    else if (OSCHF_AttemptToSwitchToXosc()) {

        Power_module->xoscPending = FALSE;

        /* initiate RCOSC calibration */
        if (Power_calibrateRCOSC) {
            readyToCal = Power_initiateCalibration();
        }

        /* now notify clients that were waiting for a switch notification */
        Power_notify(Power_XOSC_HF_SWITCHED);

        /* if ready to start first cal measurment, do it now */
        if (Power_calibrateRCOSC) {
            if (readyToCal == TRUE) {
                Power_doCalibrate();
            }
        }
    }

    /* else, wait some more, then see if can switch ... */
    else {
        /* calculate wait timeout in units of ticks */
        timeout = Power_retryWaitXOSC_HF / ti_sysbios_knl_Clock_tickPeriod;
        if (timeout == 0) {
            timeout = 1;   /* wait at least 1 tick */
        }

        /* re-start Clock object with retry timeout */
        ti_sysbios_knl_Clock_setTimeout(
            ti_sysbios_family_arm_cc26xx_Power_Module_State_xoscClockObj(),
            timeout);
        ti_sysbios_knl_Clock_start(
            ti_sysbios_family_arm_cc26xx_Power_Module_State_xoscClockObj());
    }

