mobiaqua/ti-sysbios-c64t/packages/ti/sysbios/family/arm/cc26xx/Power.c
    ti_sysbios_hal_Hwi_restore(key);
}

/*
 *  ======== Power_XOSC_HF ========
 */
UInt Power_XOSC_HF (UInt action)
{
    UInt32 timeout;

    if (action == ENABLE) {
        if (OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_XOSC_HF) {
            OSCHF_TurnOnXosc();

            Power_module->xoscPending = TRUE;

            /* calculate wait timeout in units of ticks */
            timeout = Power_initialWaitXOSC_HF /
                ti_sysbios_knl_Clock_tickPeriod;
            if (timeout == 0) {
                timeout = 1;   /* wait at least 1 tick */
            }

            /* start Clock object with initial timeout */
            ti_sysbios_knl_Clock_stop(
                ti_sysbios_family_arm_cc26xx_Power_Module_State_xoscClockObj());
            ti_sysbios_knl_Clock_setTimeout(
                ti_sysbios_family_arm_cc26xx_Power_Module_State_xoscClockObj(),
                timeout);
            ti_sysbios_knl_Clock_start(
                ti_sysbios_family_arm_cc26xx_Power_Module_State_xoscClockObj());
        }
    }

    /* when release XOSC_HF, auto switch to RCOSC_HF */
    else {
        OSCHF_SwitchToRcOscTurnOffXosc();
    }
    return (0);
}

/*
 *  ======== Power_isDependencyActive ========
 */
Bool Power_isDependencyActive (Power_Resource resourceID)
{
    Bool status = TRUE;

    /* check if the special XOSC_HF resource ...*/
    if(resourceID == XOSC_HF) {

        /* check to see if XOSC_HF is the active source */
        if(OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_XOSC_HF) {
            status = FALSE;
        }
    }

    /* else, all other resources ... */
    else {

       /* resource is active if dependency count != 0 */
        if(Power_module->resourceCounts[resourceID] == 0) {
            status = FALSE;
        }
    }

    return (status);
}

/*
 *  ======== Power_NOP (UInt action) ========
 */
UInt Power_NOP (UInt action)
{
    return (0);
}

Fxn ti_sysbios_family_arm_cc26xx_Power_resourceHandlers[3] =
{
    (Fxn) Power_RFCORECLKS,
    (Fxn) Power_XOSC_HF,
    (Fxn) Power_NOP
};
